# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [148]:
import pandas as pd
import os
import matplotlib.pyplot as plt

# Schetsen

In [149]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    },
#    index = ['a', 'b', 'c']
)

# Standaard print
print(df)

# Vergelijk met
display(df)

print(1)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

1

In [150]:
# Data opslaan

df.to_csv('../csv/persons.csv', header = True, index = False)
#os.getcwd()

In [151]:
# Data inlezen
df_saved = pd.read_csv('../csv/persons.csv')

display(df_saved)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [152]:
# De kolomnaam
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [153]:
# Een kolom lezen

df['Age']

display(df.Age)

0    22
1    35
2    58
Name: Age, dtype: int64

In [154]:
# Een kolom verwijder

# col = df.pop('Age')

# display(col)
display(df)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [167]:
df_copy = df.copy()

df_copy_copy = df_copy.drop('Age', axis = 1)

display(df_copy)
display(df_copy_copy)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name     Sex
0   Braund, Mr. Owen Harris    male
1  Allen, Mr. William Henry    male
2  Bonnell, Miss. Elizabeth  female

In [172]:
# Een rij lezen
df.iloc[0,1]
# OF
df.iloc[0]['Age']

22

In [174]:
# Functie getRow() maken

def getRow(df, index):
    
    return df.iloc[index]

getRow(df, 2)

Name    Bonnell, Miss. Elizabeth
Age                           58
Sex                       female
Name: 2, dtype: object

In [177]:
# Een rij toevoegen

df_copy = df.copy()

# df_copy.add([])
df_copy.loc[3] = ('Christie', '25', 'Female')

display(df_copy)

pd.concat(df_copy,

                       Name Age     Sex
0   Braund, Mr. Owen Harris  22    male
1  Allen, Mr. William Henry  35    male
2  Bonnell, Miss. Elizabeth  58  female
3                  Christie  25  Female

In [159]:
# Functie insertAt(row, index)
# ...

In [160]:
# Verkennen
# ...

In [203]:
# Filteren

df.query("Age > 30 and Sex == 'male'")

# Zoek op mw Bonnell

mss = df.query("Name == 'Bonnell, Miss. Elizabeth'")

mss['Sex']

2    female
Name: Sex, dtype: object

In [190]:
# Filteren 2

df[df["Age"] > 30]

                       Name  Age     Sex
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [202]:
# Filteren 3

df[df["Name"].str.contains("")]

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [162]:
# Groeperen

In [163]:
# Extra: toepassing OOP en het bouwen van je eigen library
# ...